Revit 2026 API

# UIApplicationCreateRibbonPanel(String) Method

---

Create a new RibbonPanel on the Add-Ins tab.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual RibbonPanel CreateRibbonPanel(
	string panelName
)
```
```vb
Public Overridable Function CreateRibbonPanel (
	panelName As String
) As RibbonPanel
```
```cpp
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ panelName
)
```
```fsharp
abstract CreateRibbonPanel :
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        panelName : string -> RibbonPanel
```

#### Parameters

panelName String
    The name of the panel to be created.

#### Return Value

RibbonPanel

| Exception | Condition |
| --- | --- |
| ArgumentNullException | panelName is . |
| ArgumentException | panelName is Empty. |
| InvalidOperationException | If more than 100 panels were created. |

This method will create a custom panel appending to the Revit AddIns tab. This method is not supported in Macros.

#### Reference

UIApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace